In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [2]:
data = Series(['one', 'two', np.nan, 'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [3]:
data.isnull() #checks to see which cell has a null value

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
data.dropna() #drop all cells with null values

0     one
1     two
3    four
dtype: object

In [5]:
dframe = DataFrame([['one', 'two', 'three'], [np.nan, 'five', '6ix'], ['seven', np.nan, 'nine'], [np.nan, np.nan, np.nan]])
dframe

       0     1      2
0    one   two  three
1    NaN  five    6ix
2  seven   NaN   nine
3    NaN   NaN    NaN

In [6]:
clean_dframe = dframe.dropna() #only drops the rows that consists of any null value

In [7]:
clean_dframe

     0    1      2
0  one  two  three

In [8]:
dframe.dropna(how='all') #drops rows that have all cells as null

       0     1      2
0    one   two  three
1    NaN  five    6ix
2  seven   NaN   nine

In [9]:
dframe.dropna(axis=1) #drops columns that consists of at least 1 null cell

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [10]:
npn = np.nan

dframe2 = DataFrame([[1,2,3,npn], [2,npn,5,6], [npn,7,npn,9], [1,npn,npn,npn]])

dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [11]:
dframe2.dropna(thresh=2) # drops the row cells have datapoints >= thresh.

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [12]:
dframe2.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [13]:
dframe2.fillna(4) #assigns the null cells to 4

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  2.0  4.0  5.0  6.0
2  4.0  7.0  4.0  9.0
3  1.0  4.0  4.0  4.0

In [14]:
dframe2.fillna({0:0, 1:4, 2:8, 3:4}) # assigns the cell columns different numbers, based on the column's.

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  2.0  4.0  5.0  6.0
2  0.0  7.0  8.0  9.0
3  1.0  4.0  8.0  4.0

In [15]:
dframe2.fillna(0)

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

In [16]:
dframe2.fillna(0, inplace=True) #perminantely change the data frame.

In [18]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0